In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("iris_missing.csv")

In [9]:
df_na = df.head(7)
df_na

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [13]:
df_na['Sepal_Length'].isna() # 결측치 찾아줌

0    False
1    False
2    False
3    False
4    False
5    False
6     True
Name: Sepal_Length, dtype: bool

In [12]:
df_na['Sepal_Length'].isna().sum() # 결측치 개수 (True = 1, False = 0 이니까)

1

In [14]:
df_na.isna()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width  Species
0         False         True          True        False    False
1         False        False         False        False    False
2         False        False         False        False     True
3         False        False         False        False    False
4         False        False         False        False     True
5         False        False         False        False    False
6          True         True          True         True    False

In [15]:
df_na.isna().sum() # column 방향, 각 변수별 결측치 개수

Sepal_Length    1
Sepal_Width     2
Petal_Length    2
Petal_Width     1
Species         2
dtype: int64

In [16]:
df_na.isna().sum(axis = 1) # row 방향, 각 인스턴스별 결측치 개수

0    2
1    0
2    1
3    0
4    1
5    0
6    4
dtype: int64

In [17]:
df_na.fillna(value = {'Sepal_Length': 999})

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6         999.0          NaN           NaN          NaN  setosa

In [18]:
df_na.fillna(value = {'Sepal_Length': 999, 
                      'Sepal_Width': 999})

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1        999.0           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6         999.0        999.0           NaN          NaN  setosa

In [19]:
df_na.fillna(value = 999)

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1        999.0         999.0          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     999
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     999
5           5.4          3.9           1.7          0.4  setosa
6         999.0        999.0         999.0        999.0  setosa

In [20]:
df_na['Sepal_Width'].mean()

3.3600000000000003

In [21]:
df_na.fillna(value = {'Sepal_Width': df_na['Sepal_Width'].mean()})

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1         3.36           NaN          0.2  setosa
1           4.9         3.00           1.4          0.2  setosa
2           4.7         3.20           1.3          0.2     NaN
3           4.6         3.10           1.5          0.2  setosa
4           5.0         3.60           1.4          0.2     NaN
5           5.4         3.90           1.7          0.4  setosa
6           NaN         3.36           NaN          NaN  setosa

In [22]:
df_na

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [24]:
df_na = df_na.fillna(value = {'Sepal_Width': df_na['Sepal_Width'].mean()})
df_na

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1         3.36           NaN          0.2  setosa
1           4.9         3.00           1.4          0.2  setosa
2           4.7         3.20           1.3          0.2     NaN
3           4.6         3.10           1.5          0.2  setosa
4           5.0         3.60           1.4          0.2     NaN
5           5.4         3.90           1.7          0.4  setosa
6           NaN         3.36           NaN          NaN  setosa

In [25]:
df_na2 = df.head(7)
df_na2

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [28]:
df_na2.dropna() #결측치 있는 인스턴스 날림

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
1           4.9          3.0           1.4          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

In [31]:
df_na2.iloc[:, :-1].dropna(how='all') # 인스턴스의 모든 값이 결측치일때 날림

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4

In [33]:
print(df['Sepal_Length'].max())
print(df['Sepal_Length'].min())
print(df['Sepal_Length'].mean())

7.9
4.3
5.853846153846154

In [39]:
print(df['Sepal_Length'].median()) # 중위값
print(df['Sepal_Length'].quantile(0.25)) # 제 1 사분위수
print(df['Sepal_Length'].quantile(0.5)) # 제 1 사분위수
print(df['Sepal_Length'].quantile(0.75)) # 제 1 사분위수

5.8
5.1
5.8
6.4

In [51]:
df.iloc[:, :-1].isna().sum()

Sepal_Length     7
Sepal_Width     13
Petal_Length    14
Petal_Width      6
dtype: int64

In [52]:
df.iloc[:, :-1].isna().sum().sum()

40

In [54]:
df_w = df.fillna(value = {'Sepal_Width': df['Sepal_Width'].mean()})
df_w.head(7)

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1     3.070073           NaN          0.2  setosa
1           4.9     3.000000           1.4          0.2  setosa
2           4.7     3.200000           1.3          0.2     NaN
3           4.6     3.100000           1.5          0.2  setosa
4           5.0     3.600000           1.4          0.2     NaN
5           5.4     3.900000           1.7          0.4  setosa
6           NaN     3.070073           NaN          NaN  setosa

In [59]:
df_w['Sepal_Width'].var()

0.17561945818840946

In [62]:
df_new = pd.read_csv("iris.csv") # 교재 문제 3번

In [63]:
df_new.head(4)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa

In [64]:
df_l = df_new['Sepal.Length']
m = df_l.mean()
s = df_l.std()
m, s

(5.843333333333335, 0.8280661279778629)

In [66]:
# 조건 걸어서 데이터프레임 추출
cond_1 = df_l < (m - 1.5 * s)
cond_2 = df_l > (m + 1.5 * s)
df_out = df_l.loc[(cond_1) | (cond_2)]
len(df_out)

21